<a href="https://colab.research.google.com/github/yuanjinren/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [6]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-03-18 01:37:58--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.217.46.86
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.217.46.86|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  95.0MB/s    in 2.1s

2020-03-18 01:38:00 (95.0 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [7]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [8]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [9]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

In [0]:
import pandas as pd

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [16]:
products_df = pd.read_csv('products.csv')
print(products_df.shape)
products_df.head()

(49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [20]:
new_products_df = products_df[['product_id','product_name']]
new_products_df.head()

   product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce

In [21]:
order_products_prior_df = pd.read_csv('order_products__prior.csv')
order_products_prior_df.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [23]:
new_order_products_prior_df = order_products_prior_df [['product_id','order_id']]
new_order_products_prior_df.head()

   product_id  order_id
0       33120         2
1       28985         2
2        9327         2
3       45918         2
4       30035         2

In [24]:
products_orders_df = pd.merge(new_products_df, new_order_products_prior_df, on='product_id',how='inner')
products_orders_df.head()

   product_id                product_name  order_id
0           1  Chocolate Sandwich Cookies      1107
1           1  Chocolate Sandwich Cookies      5319
2           1  Chocolate Sandwich Cookies      7540
3           1  Chocolate Sandwich Cookies      9228
4           1  Chocolate Sandwich Cookies      9273

In [13]:
orders_df = pd.read_csv('orders.csv')
orders_df.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [25]:
new_orders_df = orders_df[['order_id','order_number']]
new_orders_df.head()

   order_id  order_number
0   2539329             1
1   2398795             2
2    473747             3
3   2254736             4
4    431534             5

In [27]:
products_ordersid_df = pd.merge(products_orders_df, new_orders_df, on='order_id',how='inner')
products_ordersid_df.head(20)

    product_id                    product_name  order_id  order_number
0            1      Chocolate Sandwich Cookies      1107             2
1          769          Sliced American Cheese      1107             2
2         6184                     Clementines      1107             2
3         8048         Packaged Grape Tomatoes      1107             2
4         9007                  Frosted Flakes      1107             2
5         9434             Bag of Large Lemons      1107             2
6        12078   Shredded Mexican Blend Cheese      1107             2
7        13176          Bag of Organic Bananas      1107             2
8        16797                    Strawberries      1107             2
9        24532  Cranberry Almond Chicken Salad      1107             2
10       26553                    Butter Bread      1107             2
11       28413       Bunny-Luv Organic Carrots      1107             2
12       32538                Chunk Light Tuna      1107             2
13       32689                  Romaine Hearts      1107             2
14       34234       Grade AA Large White Eggs      1107             2
15       43867     100% Grated Parmesan Cheese      1107             2
16       46149               Zero Calorie Cola      1107             2
17           1      Chocolate Sandwich Cookies      5319            65
18        9076                     Blueberries      5319            65
19       14161                            Kiwi      5319            65

In [58]:
 new_df =products_ordersid_df.groupby('product_name')[['order_number']].sum()
 new_df.sort_values(by='order_number',ascending=False).head(10)

                        order_number
product_name
Banana                       8143983
Bag of Organic Bananas       7764805
Organic Strawberries         4663412
Organic Baby Spinach         4241134
Organic Hass Avocado         4147896
Organic Raspberries          2993989
Organic Whole Milk           2746133
Organic Avocado              2730801
Large Lemon                  2728933
Strawberries                 2530792

In [64]:
products_ordersid_df.pivot_table('order_number', 'product_name', aggfunc='sum').sort_values('order_number',ascending=False).head(10)

                        order_number
product_name
Banana                       8143983
Bag of Organic Bananas       7764805
Organic Strawberries         4663412
Organic Baby Spinach         4241134
Organic Hass Avocado         4147896
Organic Raspberries          2993989
Organic Whole Milk           2746133
Organic Avocado              2730801
Large Lemon                  2728933
Strawberries                 2530792

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [50]:
import numpy as np
table1 = pd.DataFrame(
    [[np.nan, 2],
     [16, 11],
     [3, 1]],
     index = ['John Smith', 'Jane Doe', 'Mary Johnson'], 
     columns = ['treatmenta', 'treatmentb']
)
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [12]:
#Tidy 
table1.columns.tolist()

['treatmenta', 'treatmentb']

In [13]:
table1.index.tolist()

['John Smith', 'Jane Doe', 'Mary Johnson']

In [14]:
table1 = table1.reset_index()
table1

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [15]:
tidy = table1.melt(id_vars='index', value_vars=['treatmenta','treatmentb'])
tidy

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [16]:
tidy = tidy.rename(columns = {
     'index':'name',
     'variable': 'trt',
     'value':'result'
})
tidy.trt = tidy.trt.str.replace('treatment','')
tidy

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

# Tidy Table **2**

In [51]:
table2 = table1.T
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [52]:
table2.columns.tolist()

['John Smith', 'Jane Doe', 'Mary Johnson']

In [53]:
table2.index.tolist()

['treatmenta', 'treatmentb']

In [57]:
table2 = table2.reset_index()
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [60]:
tidy2 = table2.melt(id_vars = 'index', value_vars=['John Smith', 'Jane Doe', 'Mary Johnson'])
tidy2

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [62]:
tidy2 = tidy2.rename(columns = {
     'index':'trt',
     'variable': 'name',
     'value':'result'
})
tidy2['trt'] = tidy2['trt'].str.replace('treatment','')
tidy2

  trt          name  result
0   a    John Smith     NaN
1   b    John Smith     2.0
2   a      Jane Doe    16.0
3   b      Jane Doe    11.0
4   a  Mary Johnson     3.0
5   b  Mary Johnson     1.0

# **Flight DataSets**

In [56]:
import seaborn as sns
flights = sns.load_dataset('flights')
print(flights.shape)
flights.head()

(144, 3)

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [84]:
flights.pivot_table(index = 'year', columns = 'month', values = 'passengers')

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####